{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8482c48f",
   "metadata": {},
   "source": [
    "## Preparation\n",
    "\n",
    "Install the required packages with `pip install \"neo4j-graphrag[openai]\"`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "51b79dfa",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from neo4j import GraphDatabase\n",
    "from neo4j_graphrag.indexes import upsert_vectors\n",
    "from neo4j_graphrag.embeddings import OpenAIEmbeddings\n",
    "from neo4j_graphrag.types import EntityType\n",
    "from neo4j_graphrag.retrievers import VectorRetriever\n",
    "import json\n",
    "import ast\n",
    "from typing import Any\n",
    "\n",
    "# Insert path to your STIX ATT&CK file\n",
    "with open(\"enterprise-attack-17.1.json\", \"r\") as file:\n",
    "    data = json.load(file)\n",
    "\n",
    "# Insert your OpenAI API key\n",
    "os.environ[\"OPENAI_API_KEY\"] = (\n",
    "    \"sk-proj-Qlq_pOwi-Zz_fon5Q8zLfTx-XXXXXuP2Mw_rti-9tlIFP9-1S7O5A1lFIHMjYyK3sAcEmW1V7_T3BlbkFJ6OmFl-ptdSUSx9tiwI8_tZVJtXmhf6CNSk0XWiuRgXuTIe0rVb4mrBUexPW7XA-qlgjMKxZoMA\"\n",
    ")\n",
    "\n",
    "# Insert your Neo4j instance URL and credentials\n",
    "URI = \"neo4j+s://6224f1f3.databases.neo4j.io\"\n",
    "AUTH = (\"neo4j\", \"DBy7vuJuvsbib8F3FRhIXzIFu5vsgPxs31gJoANwMlo\")\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "embedder = OpenAIEmbeddings(model=\"text-embedding-3-large\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ba77482a",
   "metadata": {},
   "source": [
    "## KG Construction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b1e334fe",
   "metadata": {},
   "outputs": [],
   "source": [
    "def flatten_dict(d) -> dict[Any, str]:\n",
    "    return {k: str(v) for k, v in d.items()}\n",
    "\n",
    "\n",
    "def create_sdo_node(tx, props) -> None:\n",
    "    query = \"CREATE (n:SDO $props)\"\n",
    "    tx.run(query, props=props)\n",
    "\n",
    "\n",
    "def create_relation(tx, src, tgt, rel_type, props) -> None:\n",
    "    query = f\"\"\"\n",
    "    MATCH (a {{id: $source_id}})\n",
    "    MATCH (b {{id: $target_id}})\n",
    "    MERGE (a)-[r:{rel_type}]->(b)\n",
    "    SET r += $props\n",
    "    \"\"\"\n",
    "    tx.run(query, source_id=src, target_id=tgt, props=props)\n",
    "\n",
    "\n",
    "with driver.session() as session:\n",
    "    for obj in data[\"objects\"]:\n",
    "        flat_obj = flatten_dict(obj)\n",
    "        if flat_obj[\"type\"] == \"relationship\":\n",
    "            rel_type = flat_obj[\"relationship_type\"].replace(\"-\", \"_\")\n",
    "            props = {\n",
    "                k: v\n",
    "                for k, v in flat_obj.items()\n",
    "                if k not in (\"source_ref\", \"target_ref\", \"relationship_type\")\n",
    "            }\n",
    "            session.execute_write(\n",
    "                create_relation,\n",
    "                flat_obj[\"source_ref\"],\n",
    "                flat_obj[\"target_ref\"],\n",
    "                rel_type,\n",
    "                props,\n",
    "            )\n",
    "        else:\n",
    "            session.execute_write(create_sdo_node, flat_obj)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bd880a81",
   "metadata": {},
   "source": [
    "## Create and populate Vector Index"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e09d41bb",
   "metadata": {},
   "source": [
    "Run this Cypher query on your instance: \n",
    "\n",
    "\n",
    "```Cypher\n",
    "CREATE VECTOR INDEX nodes IF NOT EXISTS\n",
    "FOR (e:SDO)\n",
    "ON e.embedding\n",
    "OPTIONS { indexConfig: {\n",
    "    `vector.dimensions`: 3072,\n",
    "    `vector.similarity_function`: 'cosine',\n",
    "    `vector.quantization.enabled`: false\n",
    "}}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "334baff5",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    nodes = session.run(\"MATCH (n) RETURN n\")\n",
    "    for record in nodes:\n",
    "        node = record[\"n\"]\n",
    "        if node[\"description\"] is not None:\n",
    "            vector = embedder.embed_query(node[\"description\"])\n",
    "            upsert_vectors(\n",
    "                driver,\n",
    "                ids=[node.element_id],\n",
    "                embedding_property=\"embedding\",\n",
    "                embeddings=[vector],\n",
    "                entity_type=EntityType.NODE,\n",
    "            )"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "09fbc450",
   "metadata": {},
   "source": [
    "## Similarity Search"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6738e7b0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Sudo and Sudo Caching\n",
      "attack-pattern\n",
      "Adversaries may perform sudo caching and/or use the sudoers file to elevate privileges. Adversaries may do this to execute commands as other users or spawn processes with higher privileges.\n",
      "\n",
      "Within Linux and MacOS systems, sudo (sometimes referred to as \"superuser do\") allows users to perform commands from terminals with elevated privileges and to control who can perform these commands on the system. The <code>sudo</code> command \"allows a system administrator to delegate authority to give certain users (or groups of users) the ability to run some (or all) commands as root or another user while providing an audit trail of the commands and their arguments.\"(Citation: sudo man page 2018) Since sudo was made for the system administrator, it has some useful configuration features such as a <code>timestamp_timeout</code>, which is the amount of time in minutes between instances of <code>sudo</code> before it will re-prompt for a password. This is because <code>sudo</code> has the ability to cache credentials for a period of time. Sudo creates (or touches) a file at <code>/var/db/sudo</code> with a timestamp of when sudo was last run to determine this timeout. Additionally, there is a <code>tty_tickets</code> variable that treats each new tty (terminal session) in isolation. This means that, for example, the sudo timeout of one tty will not affect another tty (you will have to type the password again).\n",
      "\n",
      "The sudoers file, <code>/etc/sudoers</code>, describes which users can run which commands and from which terminals. This also describes which commands users can run as other users or groups. This provides the principle of least privilege such that users are running in their lowest possible permissions for most of the time and only elevate to other users or permissions as needed, typically by prompting for a password. However, the sudoers file can also specify when to not prompt users for passwords with a line like <code>user1 ALL=(ALL) NOPASSWD: ALL</code>.(Citation: OSX.Dok Malware) Elevated privileges are required to edit this file though.\n",
      "\n",
      "Adversaries can also abuse poor configurations of these mechanisms to escalate privileges without needing the user's password. For example, <code>/var/db/sudo</code>'s timestamp can be monitored to see if it falls within the <code>timestamp_timeout</code> range. If it does, then malware can execute sudo commands without needing to supply the user's password. Additional, if <code>tty_tickets</code> is disabled, adversaries can do this from any tty for that user.\n",
      "\n",
      "In the wild, malware has disabled <code>tty_tickets</code> to potentially make scripting easier by issuing <code>echo \\'Defaults !tty_tickets\\' >> /etc/sudoers</code>.(Citation: cybereason osx proton) In order for this change to be reflected, the malware also issued <code>killall Terminal</code>. As of macOS Sierra, the sudoers file has <code>tty_tickets</code> enabled by default.\n",
      "---------------------\n",
      "Sudo Mitigation\n",
      "course-of-action\n",
      "The sudoers file should be strictly edited such that passwords are always required and that users can’t spawn risky processes as users with higher privilege. By requiring a password, even if an adversary can get terminal access, they must know the password to run anything in the sudoers file.\n",
      "---------------------\n",
      "Sudo\n",
      "attack-pattern\n",
      "The sudoers file, <code>/etc/sudoers</code>, describes which users can run which commands and from which terminals. This also describes which commands users can run as other users or groups. This provides the idea of least privilege such that users are running in their lowest possible permissions for most of the time and only elevate to other users or permissions as needed, typically by prompting for a password. However, the sudoers file can also specify when to not prompt users for passwords with a line like <code>user1 ALL=(ALL) NOPASSWD: ALL</code> (Citation: OSX.Dok Malware). \n",
      "\n",
      "Adversaries can take advantage of these configurations to execute commands as other users or spawn processes with higher privileges. You must have elevated privileges to edit this file though.\n",
      "---------------------\n"
     ]
    }
   ],
   "source": [
    "retriever = VectorRetriever(driver, \"nodes\", embedder)\n",
    "query_text = \"In a Linux environment, what is recommended to monitor for detecting privilege escalation via sudo?\"\n",
    "result = retriever.search(query_text=query_text, top_k=3)\n",
    "for item in result.items:\n",
    "    dict_item = ast.literal_eval(item.content)\n",
    "    print(dict_item[\"name\"])\n",
    "    print(dict_item[\"type\"])\n",
    "    print(dict_item[\"description\"])\n",
    "    print(\"---------------------\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".ven",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
